<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft 365 Copilot for macOS.
This recipe downloads the Microsoft 365 apps package which includes Copilot functionality.
Requires macOS 14.0+ (Sonoma) and a Microsoft 365 subscription for full functionality.</string>
	<key>Identifier</key>
	<string>com.github.jonmathias.download.MicrosoftCopilot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Copilot</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>SOFTWARETITLE</key>
		<string>Microsoft 365 Copilot</string>
		<key>DOWNLOAD_URL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=2325438</string>
		<key>INFO_URL</key>
		<string>https://www.microsoft.com/en-us/microsoft-365-copilot/download-copilot-app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%VENDOR%-%SOFTWARETITLE%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
               <key>input_path</key>
               <string>%pathname%</string>
            </dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
