<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft 365 Copilot for macOS.
This recipe downloads the Microsoft 365 apps package which includes Copilot functionality.
Requires macOS 14.0+ (Sonoma) and a Microsoft 365 subscription for full functionality.</string>
	<key>Identifier</key>
	<string>local.download.Microsoft365Copilot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft365Copilot</string>
		<key>VERSION</key>
		<string>1.0.0</string>
		<key>DOWNLOAD_URL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=2246798</string>
		<key>INFO_URL</key>
		<string>https://www.microsoft.com/en-us/microsoft-365-copilot/download-copilot-app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.microsoft.office365" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "UBF8T346G9")</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%VERSION%</string>
					<key>pkg_request</key>
					<dict>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>pkgname</key>
						<string>%NAME%-%VERSION%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>pkgtype</key>
						<string>pkg</string>
						<key>version</key>
						<string>%VERSION%</string>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
