<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of Microsoft 365 Copilot for macOS.
This recipe automatically detects the latest version and downloads the appropriate package.
Requires macOS 14.0+ (Sonoma) and a Microsoft 365 subscription for full functionality.</string>
	<key>Identifier</key>
	<string>local.download.Microsoft365Copilot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft365Copilot</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>PRERELEASE</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Microsoft365Copilot.*%ARCH%.*\.pkg</string>
				<key>github_repo</key>
				<string>microsoft/microsoft-365-copilot</string>
				<key>include_prereleases</key>
				<string>%PRERELEASE%</string>
				<key>sort_by_highest_tag_names</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.microsoft.office365" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "UBF8T346G9")</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkg_request</key>
					<dict>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>pkgtype</key>
						<string>pkg</string>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
